app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("updated_at", "title", "body", "created_at") VALUES('2008-12-04 02:26:40', 'Rails Rocks', 'Rails is a great framework for creating web application quickly. This is a simple demonstration of making a blog application. Here we generated a scaffold for managing post records. We can create posts', '2008-12-04 02:26:40')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "body" = 'Rails is a great framework for creating web application quickly. This is a simple demonstration of making a blog application. Here we generated a scaffold for managing post records. We can create posts, and even update them.', "updated_at" = '2008-12-04 02:27:09' WHERE "id" = 1